public class Main {
    public static void main(String[] args) {
        System.out.println( " Программа:бесплатные мили за перелет. " );
    int ticket = 21000;
        System.out.println( " Стоимость билета: 21000 " );
     int mile = 30;
        System.out.println( " 1 миля 30 рублей " );
     int bonus = ticket / mile;
        System.out.println( " Начислено милей " + bonus );
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
